<?php
header('Content-type: application/json;');
date_default_timezone_set('Asia/Tehran');
$DAY = date('l');
$dayInfo = [
    'Saturday' => [
        'شنبه',
        'یا رب العالمین',
        'ای پروردگار جهانیان',
        'ذکر روز شنبه به نام پیامبر اکرم (ص) است. روایت شده که در این روز زیارت حضرت رسول الله (ص) خوانده شود که خواندنش موجب بی‌نیازی می‌شود.'
    ],
    'Sunday' => [
        'یک شنبه',
        'یا ذالجلال والاکرام',
        'ای صاحب شکوه و بزرگواری',
        'ذکر روز یکشنبه که به اسم امیرالمومنین (ع) و حضرت زهرا (س) می باشد موجب فتح و نصرت می شود روایت شده است که در این روز زیارت حضرت امیرالمؤمنین (ع) و زیارت حضرت زهرا (س) خوانده شود.'
    ],
    'Monday' => [
        'دو شنبه',
        'یا قاضی الحاجات',
        'ای برآورنده حاجت‌ها',
        'ذکر روز دوشنبه به اسم امام حسن  (ع) و امام حسین (ع) است. روایت شده در روز دوشنبه زیارت  امام حسن (ع) و امام حسین (ع) خوانده شود که خواندن آن موجب کثرت مال می‌شود.'
    ],
    'Tuesday' => [
        'سه شنبه',
        'یا ارحم الراحمین',
        'ای بخشنده‌ترین بخشندگان',
        'ذکر روز سه‌شنبه به اسم  امام سجاد (ع) و امام محمد باقر (ع) و امام جعفر صادق (ع) است. روایت شده در این روز زیارت سه امام خوانده شود. ذکر روز سه شنبه موجب روا شدن حاجات می شود.'
    ],
    'Wednesday' => [
        'چهار شنبه',
        'یا حی یا قیوم',
        'ای زنده، ای پاینده',
        'ذکر روز چهارشنبه به اسم موسی کاظم (ع) و امام رضا (ع) و امام محمد بتقی (ع) و امام علی النقی (ع) است. روایت شده در این روز زیارت چهار امام خوانده شود که خواندن آن موجب عزت دائمی می‌شود.'
    ],
    'Thursday' => [
        'پنج شنبه',
        'لا اله الا الله الملک الحق المبین ',
        'معبوی جز خدا نیست؛ پادشاه برحق آشکار',
        'ذکر روز پنجشنبه به اسم امام حسن عسکری (ع) است. روایت شده در این روز زیارت امام حسن عسکری (ع) خوانده شود که خواندن آن موجب رزق و روزی می‌شود.'
    ],
    'Friday' => [
        'جمعه',
        'اللهم صل علی محمد و ال محمد',
        'خدایا رحمت فرست بر محمد و خاندان محمد',
        'ذکر روز پنجشنبه به اسم امام زمان (عج) است. روایت شده که در این روز زیارت امام زمان (عج) خوانده شود. ذکر روز جمعه باعث عزیز شدن می شود.'
    ],

];

echo json_encode([
    'status' => 200,
    'dev' => ajcode,
    'result' => [
        'day' => $dayInfo[$DAY][0],
        'zekr' => $dayInfo[$DAY][1],
        'meaning' => $dayInfo[$DAY][2],
        'explanation' => $dayInfo[$DAY][3]
    ]
], 448);
